9/data/attachments/b69aab2bc41257f9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b5bc6a06-fa07-48ad-a2ac-3213c9328c43</nif:username>
            <nif:friendToBeAdded>Christopher_successful_Friend_35217_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>